Andwardo/dcm-1-firmware/sdkconfig.defaults
// sdkconfig.defaults (updated)

# Target Chip
CONFIG_IDF_TARGET="esp32s3"

# Enable Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_VERBOSE=y

# Wi-Fi
CONFIG_ESP_WIFI_ENABLED=y
CONFIG_ESP_WIFI_NVS_ENABLED=y
# Add your network credentials here:
CONFIG_WIFI_SSID="YOUR_WIFI_SSID"
CONFIG_WIFI_PASSWORD="YOUR_WIFI_PASSWORD"

# MQTT
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=n
# Broker URI and default topic:
CONFIG_MQTT_URI="mqtts://dev1.pgapi.net:8883"
CONFIG_MQTT_TOPIC="device/dcm1/data"

# FreeRTOS
CONFIG_FREERTOS_UNICORE=n
